Revit 2027 API
View.IsInTemporaryViewMode Method
 Returns true if the view is in a particular temporary view mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInTemporaryViewMode(
	TemporaryViewMode mode
)
Public Function IsInTemporaryViewMode (
	mode As TemporaryViewMode
) As Boolean
public:
bool IsInTemporaryViewMode(
	TemporaryViewMode mode
)
member IsInTemporaryViewMode :
        mode : TemporaryViewMode -> bool
Parameters
mode TemporaryViewMode
 The mode.
Return Value
Boolean
 True if this view is in the temporary view mode indicated, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
View Class
Autodesk.Revit.DB Namespace